In [13]:
# Import the SQL database into Pandas
# Import Dependencies
%matplotlib notebook
%matplotlib inline
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
from config import password

In [14]:
#Create an engine to SQL databases
from sqlalchemy import create_engine
engine = create_engine(f"postgresql://postgres:{password}@localhost:5432/SQL_Challenge")
connect = engine.connect()

In [16]:
#Query to test records for SQL DB
employee_db = pd.read_sql("select * from employees", connect)
employee_db.head()

   emp_no emp_title  birth_date  first_name  last_name sex   hire_date
0  473302     s0001  1953-07-25    Hideyuki   Zallocco   M  1990-04-28
1  475053     e0002  1954-11-18       Byong  Delgrande   F  1991-09-07
2   57444     e0002  1958-01-30       Berry       Babb   F  1992-03-21
3  421786     s0001  1957-09-28       Xiong   Verhoeff   M  1987-11-26
4  282238     e0003  1952-10-28  Abdelkader    Baumann   F  1991-01-18

In [18]:
#Query to test records for SQL DB
salary_db = pd.read_sql("select * from salaries", connect)
salary_db.head()

   emp_no  salary
0   10001   60117
1   10002   65828
2   10003   40006
3   10004   40054
4   10005   78228

In [34]:
# Merge employee_db & salary_db  on emp_no
emp_salary = pd.merge(employee_db, salary_db, how="left", on=["emp_no", "emp_no"])
emp_salary.head()

   emp_no emp_title  birth_date  first_name  last_name sex   hire_date  salary
0  473302     s0001  1953-07-25    Hideyuki   Zallocco   M  1990-04-28   40000
1  475053     e0002  1954-11-18       Byong  Delgrande   F  1991-09-07   53422
2   57444     e0002  1958-01-30       Berry       Babb   F  1992-03-21   48973
3  421786     s0001  1957-09-28       Xiong   Verhoeff   M  1987-11-26   40000
4  282238     e0003  1952-10-28  Abdelkader    Baumann   F  1991-01-18   40000

In [35]:
titles_db = pd.read_sql("select * from titles", connect)
titles_db.rename(columns={"title_id":"emp_title"}, inplace=True)
titles_db.head()

  emp_title               title
0     s0001               Staff
1     s0002        Senior Staff
2     e0001  Assistant Engineer
3     e0002            Engineer
4     e0003     Senior Engineer

In [37]:
employee_salary = pd.merge(emp_salary, titles_db, how="left", on =["emp_title", "emp_title"])
employee_salary.head()

,emp_no,emp_title,birth_date,first_name,last_name,sex,hire_date,salary,title
0,473302,s0001,1953-07-25,Hideyuki,Zallocco,M,1990-04-28,40000,Staff
1,475053,e0002,1954-11-18,Byong,Delgrande,F,1991-09-07,53422,Engineer
2,57444,e0002,1958-01-30,Berry,Babb,F,1992-03-21,48973,Engineer
3,421786,s0001,1957-09-28,Xiong,Verhoeff,M,1987-11-26,40000,Staff
4,282238,e0003,1952-10-28,Abdelkader,Baumann,F,1991-01-18,40000,Senior Engineer